app/controllers/api/v1/athletes_controller.rb

SELECT "athletes".* FROM "athletes"
---
  def index
    athletes = Athlete.all