app/controllers/api/v1/competitions_controller.rb

SELECT "competitions".* FROM "competitions"
---
  def index
    competitions = Competition.all