app/controllers/api/v1/stats_controller.rb

  def index
    stats = Stat.all
---
SELECT "stats".* FROM "stats"